app/controllers/infos_controller.rb

  def create
    #@info = @song.infos.new(info_params)
    @info = Info.new(info_params)
    respond_to do |format|
      if @info.save
---
INSERT INTO "infos" ("song_id", "title", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["song_id", 1], ["title", "3"], ["created_at", "2018-12-11 08:52:42.078412"], ["updated_at", "2018-12-11 08:52:42.078412"]]

  def destroy
    @info.destroy
---
DELETE FROM "infos" WHERE "infos"."id" = ?  [["id", 1]]

    def set_song
      @song = Song.find_by(id: params[:song_id]) || Song.find(info_params[:song_id])
---
SELECT  "songs".* FROM "songs" WHERE "songs"."id" IS NULL LIMIT ?  [["LIMIT", 1]]

    def set_info
      @info = Info.find(params[:song_id])
---
SELECT  "infos".* FROM "infos" WHERE "infos"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]