app/controllers/songs_controller.rb

  def create
    @song = Song.new(song_params)
    @song.user = current_user
    respond_to do |format|
      if @song.save
---
INSERT INTO "songs" ("title", "description", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "1"], ["description", "2"], ["created_at", "2018-12-11 08:52:37.825623"], ["updated_at", "2018-12-11 08:52:37.825623"], ["user_id", 1]]

  def update
    respond_to do |format|
      if @song.update(song_params)
---
UPDATE "songs" SET "description" = ?, "updated_at" = ? WHERE "songs"."id" = ?  [["description", "I want you to be happier"], ["updated_at", "2018-12-10 19:52:16.332565"], ["id", 3]]